## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                       |
|--------|--------------------------------------------------|
| add    | `aws_glue_job.bes_crm_salesforce`                |
|        | `aws_glue_trigger.bes_crm_salesforce`            |
|        | `aws_s3_object.bes_crm_salesforce_job`           |
|        | `aws_s3_object.bes_crm_salesforce_requirements`  |
| delete | `aws_glue_crawler.bes_crm_salesforce_production` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_glue_crawler.bes_crm_salesforce_production will be destroyed
  # (because aws_glue_crawler.bes_crm_salesforce_production is not in configuration)
  - resource "aws_glue_crawler" "bes_crm_salesforce_production" {
      - arn                    = "arn:aws:glue:ca-central-1:739275439843:crawler/BES / CRM / Salesforce" -> null
      - classifiers            = [] -> null
      - configuration          = jsonencode(
            {
              - CrawlerOutput        = {
                  - Tables = {
                      - TableThreshold = 10
                    }
                }
              - CreatePartitionIndex = true
              - Version              = 1.0
            }
        ) -> null
      - database_name          = "bes_crm_salesforce_production_raw" -> null
      - description            = "Classify the CDS Salesforce CRM data" -> null
      - id                     = "BES / CRM / Salesforce" -> null
      - name                   = "BES / CRM / Salesforce" -> null
      - role                   = "service-role/AWSGlueCrawler-DataLake" -> null
      - schedule               = "cron(00 7 1 * ? *)" -> null
      - security_configuration = "encryption-at-rest" -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
        # (1 unchanged attribute hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      - s3_target {
          - exclusions          = [] -> null
          - path                = "s3://cds-data-lake-raw-production/bes/crm/salesforce" -> null
          - sample_size         = 0 -> null
            # (3 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_job.bes_crm_salesforce will be created
  + resource "aws_glue_job" "bes_crm_salesforce" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--additional-python-modules"        = "s3://cds-data-lake-glue-production/bes/crm/salesforce/requirements.txt"
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "bes_crm_salesforce"
          + "--database_name_transformed"        = "bes_crm_salesforce_production"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--job-language"                     = "python"
          + "--python-modules-installer-option"  = "-r"
          + "--source_bucket"                    = "cds-data-lake-raw-production"
          + "--source_prefix"                    = "bes/crm/salesforce/"
          + "--table_name"                       = "account_opportunity"
          + "--transformed_bucket"               = "cds-data-lake-transformed-production"
          + "--transformed_prefix"               = "bes/crm/salesforce/"
        }
      + execution_class        = "FLEX"
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "BES / CRM / Salesforce"
      + number_of_workers      = (known after apply)
      + role_arn               = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake"
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://cds-data-lake-glue-production/bes/crm/salesforce/process_salesforce.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_trigger.bes_crm_salesforce will be created
  + resource "aws_glue_trigger" "bes_crm_salesforce" {
      + arn      = (known after apply)
      + enabled  = true
      + id       = (known after apply)
      + name     = "BES / CRM / Salesforce"
      + schedule = "cron(00 7 * * ? *)"
      + state    = (known after apply)
      + tags_all = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + type     = "SCHEDULED"

      + actions {
          + job_name = "BES / CRM / Salesforce"
        }
    }

  # aws_s3_object.bes_crm_salesforce_job will be created
  + resource "aws_s3_object" "bes_crm_salesforce_job" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "c4a8987c655b7f44ab8601562caa89ab"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "bes/crm/salesforce/process_salesforce.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/bes/crm/scripts/process_salesforce.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.bes_crm_salesforce_requirements will be created
  + resource "aws_s3_object" "bes_crm_salesforce_requirements" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "94d18cc6f3c8e50a1e3a988e78e6a849"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "bes/crm/salesforce/requirements.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/support/freshdesk/scripts/requirements.txt"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
